import { SectionContentType } from '~/helpers/types/content/section-content.types';

export const OBJECTIVE_RUS: SectionContentType = {
  title: 'Цели',
  content: [
    {
      title: null,
      text: 'я - начинающий, разработчик (занимаюсь разработкой с сентября 2021). Имею небольшой опыт в коммерческом проекте. Я ищу свою первую работу, чтобы она стала основой моей будущей карьеры. Я претендую на позицию трейни или junior frontend разработчика',
      props: {
        tag: 'h2',
      },
    },
    {
      title: 'Что я смогу дать',
      text: 'свой опыт работы в проекте (основной задачей был поиск и исправление багов) и стартапе (основной задачей была разработка элементов интерфейса некоторых разделов, багофиксинг) и свои профессиональные и личностные навыки которые я приобрел ипреобрету в будущем',
      props: {
        tag: 'h2',
      },
    },
    {
      title: 'Что я ожиаю получить',
      text: 'прежде всего - опыт. Работу в крутой позитивной комманде, интересные таски (но я готов браться за любые, самые скучные задания, пока не докажу, что я способен на большее). А так же зарплату и возможность карьерного роста по результатам моей работы',
      props: {
        tag: 'h2',
      },
    },
    {
      title: 'P.S',
      text: 'если вы ищете джуниора с опытом работы 100+ лет и знанием всех земных и инопланетных технологий - это не я. Но если вам нужен человек, кто реально будет стараться, потому что это то, чем он хочет заниматься всю жизнь - вы можете дать мне шанс! :)',
      props: {
        tag: 'h4',
      },
    },
  ],
};
