import { SectionContentType } from '~/helpers/types/content.types';

export const SOFT_SKILLS_RUS: SectionContentType = {
  title: 'Софт-Скиллы',
  content: [
    {
      title: 'Самостоятельность',
      text: 'осознаю, что отвлекать ментора от работы по любому пустяку это плохо. Всегда задаю вопросы по таску перед тем как приступить к его выполнению. Ищу решение проблем, появившихся в процессе, самостоятельно, прибегая к помощи наставика только в крайнем случае, или когда поиск решения может сильно повлиять на производительность',
      props: {
        tag: 'h2',
      },
    },
    {
      title: 'Обучаемость',
      text: 'люблю изучать новые технологии, и изучаю их в свободное время. Всегда обращаюсь к нескольким источникам информации. Читаю документацию, статьи, видеогайды и дополнительную литературу. Срадостью воспринимаю обоснованную критику, перепишу весь код и в следующий раз не наступлю на те же грабли',
      props: {
        tag: 'h2',
      },
    },
    {
      title: 'Мультизадачность',
      text: 'свободно переключаюсь между проектами и задачами',
      props: {
        tag: 'h2',
      },
    },
    {
      title: 'Самоорганизация',
      text: 'трекинг времени и фиксация прогресса для меня уже неотъемлемя часть разработки. Строю планы работ и стараюсь оценивать затраты времени на ее выполнение. Стараюсь много работать, но не забывать про отдых',
      props: {
        tag: 'h2',
      },
    },
    {
      title: 'Позитивное мышление',
      text: 'не пасую перед трудностями, а воспринимаю их как квест, пройдя который получаешь пойнт в копилку своего опыта',
      props: {
        tag: 'h2',
      },
    },
    {
      title: 'Коммуникабельность',
      text: 'легко общаюсь с людьми и нахожу с ними общий язык. Не обращаю внимания на колкости токсичных людей, и стараюсь видеть всех только с лучшей стороны',
      props: {
        tag: 'h2',
      },
    },
  ],
};
